Repository: AlekSIS-org/AlekSIS-App-CSVImport
Catalog: aleksis/apps/csv_import/locale/*/LC_MESSAGES/django.po
Languages: de_de

source: CSV export of teachers
de_de: CSV-Export der Lehrer

source: CSV export of students
de_de: CSV-Export der Schüler

source: CSV export of guardians/parents
de_de: CSV-Export der Erziehungsberechtigten/Eltern

source: Path to CSV file with exported teachers
de_de: Pfad zur CSV-Datei mit den exportierten Lehrern

source: Path to CSV file with exported students
de_de: Pfad zur CSV-Datei mit den exportierten Schülern

source: Path to CSV file with exported guardians
de_de: Pfad zur CSV-Datei mit den exportierten Erziehungsberechtigten

source: SchILD-NRW provides export functions for basic data of students, teachers and guardians as CSV files. You can import a set of such files here.
de_de: SchILD-NRW bietet Exportfunktionen für die Grunddaten von Schülern, Lehrern und Erziehungsberechtigten als CSV-Dateien. Sie können eine Reihe solcher Dateien hier importieren.

source: To generate CSV files in the correct format, please use the following templates:
de_de: Um die CSV-Dateien im richtigen Format zu generieren, nutzen Sie bitte die folgenden Vorlagen:

source: SchILD-NRW CSV export template for students
de_de: SchILD-NRW-CSV-Exportvorlage für Schüler

source: SchILD-NRW CSV export template for teachers
de_de: SchILD-NRW-CSV-Exportvorlage für Lehrer

source: SchILD-NRW CSV export template for guardians
de_de: SchILD-NRW-CSV-Exportvorlage für Erziehungsberechtigte

source: Failed to import person %s
de_de: Fehler beim Importieren der Person %s

source: %d existing persons were deactivated.
de_de: %d existierende Personen wurden deaktiviert.

source: %d persons were newly created.
de_de: %d Personen wurden erstellt.

source: All persons were imported successfully.
de_de: Alle Personen wurden erfolgreich importiert.

source: Some persons failed to be imported.
de_de: Einige Personen konnten nicht importiert werden.
